# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

n = int(input('Input number of letter: '));
print('Letter with number ', n, ' - ', chr(n));